espressif/esp-idf/components/soc/esp32s31/register/soc/touch_aon_reg.h
/** TOUCH_AON_ANA_PARA_REG register
 *  need_des
 */
#define TOUCH_AON_ANA_PARA_REG (DR_REG_TOUCH_AON_BASE + 0x3c)
/** TOUCH_AON_TOUCH_TOUCH_BUF_DRV : R/W; bitpos: [2:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_TOUCH_BUF_DRV    0x00000007U
#define TOUCH_AON_TOUCH_TOUCH_BUF_DRV_M  (TOUCH_AON_TOUCH_TOUCH_BUF_DRV_V << TOUCH_AON_TOUCH_TOUCH_BUF_DRV_S)
#define TOUCH_AON_TOUCH_TOUCH_BUF_DRV_V  0x00000007U
#define TOUCH_AON_TOUCH_TOUCH_BUF_DRV_S  0
/** TOUCH_AON_TOUCH_TOUCH_EN_CAL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_TOUCH_EN_CAL    (BIT(3))
#define TOUCH_AON_TOUCH_TOUCH_EN_CAL_M  (TOUCH_AON_TOUCH_TOUCH_EN_CAL_V << TOUCH_AON_TOUCH_TOUCH_EN_CAL_S)
#define TOUCH_AON_TOUCH_TOUCH_EN_CAL_V  0x00000001U
#define TOUCH_AON_TOUCH_TOUCH_EN_CAL_S  3
/** TOUCH_AON_TOUCH_TOUCH_DCAP_CAL : R/W; bitpos: [10:4]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_TOUCH_DCAP_CAL    0x0000007FU
#define TOUCH_AON_TOUCH_TOUCH_DCAP_CAL_M  (TOUCH_AON_TOUCH_TOUCH_DCAP_CAL_V << TOUCH_AON_TOUCH_TOUCH_DCAP_CAL_S)
#define TOUCH_AON_TOUCH_TOUCH_DCAP_CAL_V  0x0000007FU
#define TOUCH_AON_TOUCH_TOUCH_DCAP_CAL_S  4
/** TOUCH_AON_TOUCH_DREFH : R/W; bitpos: [12:11]; default: 3;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DREFH    0x00000003U
#define TOUCH_AON_TOUCH_DREFH_M  (TOUCH_AON_TOUCH_DREFH_V << TOUCH_AON_TOUCH_DREFH_S)
#define TOUCH_AON_TOUCH_DREFH_V  0x00000003U
#define TOUCH_AON_TOUCH_DREFH_S  11
/** TOUCH_AON_TOUCH_DREFL : R/W; bitpos: [14:13]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DREFL    0x00000003U
#define TOUCH_AON_TOUCH_DREFL_M  (TOUCH_AON_TOUCH_DREFL_V << TOUCH_AON_TOUCH_DREFL_S)
#define TOUCH_AON_TOUCH_DREFL_V  0x00000003U
#define TOUCH_AON_TOUCH_DREFL_S  13

/** TOUCH_AON_MUX0_REG register
 *  need_des
 */
#define TOUCH_AON_MUX0_REG (DR_REG_TOUCH_AON_BASE + 0x40)
/** TOUCH_AON_TOUCH_DATA_SEL : R/W; bitpos: [9:8]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DATA_SEL    0x00000003U
#define TOUCH_AON_TOUCH_DATA_SEL_M  (TOUCH_AON_TOUCH_DATA_SEL_V << TOUCH_AON_TOUCH_DATA_SEL_S)
#define TOUCH_AON_TOUCH_DATA_SEL_V  0x00000003U
#define TOUCH_AON_TOUCH_DATA_SEL_S  8
/** TOUCH_AON_TOUCH_FREQ_SEL : R/W; bitpos: [11:10]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ_SEL    0x00000003U
#define TOUCH_AON_TOUCH_FREQ_SEL_M  (TOUCH_AON_TOUCH_FREQ_SEL_V << TOUCH_AON_TOUCH_FREQ_SEL_S)
#define TOUCH_AON_TOUCH_FREQ_SEL_V  0x00000003U
#define TOUCH_AON_TOUCH_FREQ_SEL_S  10
/** TOUCH_AON_TOUCH_BUFSEL : R/W; bitpos: [26:12]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_BUFSEL    0x00007FFFU
#define TOUCH_AON_TOUCH_BUFSEL_M  (TOUCH_AON_TOUCH_BUFSEL_V << TOUCH_AON_TOUCH_BUFSEL_S)
#define TOUCH_AON_TOUCH_BUFSEL_V  0x00007FFFU
#define TOUCH_AON_TOUCH_BUFSEL_S  12
/** TOUCH_AON_TOUCH_DONE_EN : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DONE_EN    (BIT(27))
#define TOUCH_AON_TOUCH_DONE_EN_M  (TOUCH_AON_TOUCH_DONE_EN_V << TOUCH_AON_TOUCH_DONE_EN_S)
#define TOUCH_AON_TOUCH_DONE_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_DONE_EN_S  27
/** TOUCH_AON_TOUCH_DONE_FORCE : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DONE_FORCE    (BIT(28))
#define TOUCH_AON_TOUCH_DONE_FORCE_M  (TOUCH_AON_TOUCH_DONE_FORCE_V << TOUCH_AON_TOUCH_DONE_FORCE_S)
#define TOUCH_AON_TOUCH_DONE_FORCE_V  0x00000001U
#define TOUCH_AON_TOUCH_DONE_FORCE_S  28
/** TOUCH_AON_TOUCH_FSM_EN : R/W; bitpos: [29]; default: 1;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FSM_EN    (BIT(29))
#define TOUCH_AON_TOUCH_FSM_EN_M  (TOUCH_AON_TOUCH_FSM_EN_V << TOUCH_AON_TOUCH_FSM_EN_S)
#define TOUCH_AON_TOUCH_FSM_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_FSM_EN_S  29
/** TOUCH_AON_TOUCH_START_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_START_EN    (BIT(30))
#define TOUCH_AON_TOUCH_START_EN_M  (TOUCH_AON_TOUCH_START_EN_V << TOUCH_AON_TOUCH_START_EN_S)
#define TOUCH_AON_TOUCH_START_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_START_EN_S  30
/** TOUCH_AON_TOUCH_START_FORCE : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_START_FORCE    (BIT(31))
#define TOUCH_AON_TOUCH_START_FORCE_M  (TOUCH_AON_TOUCH_START_FORCE_V << TOUCH_AON_TOUCH_START_FORCE_S)
#define TOUCH_AON_TOUCH_START_FORCE_V  0x00000001U
#define TOUCH_AON_TOUCH_START_FORCE_S  31

/** TOUCH_AON_MUX1_REG register
 *  need_des
 */
#define TOUCH_AON_MUX1_REG (DR_REG_TOUCH_AON_BASE + 0x44)
/** TOUCH_AON_TOUCH_START : R/W; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_START    0x00007FFFU
#define TOUCH_AON_TOUCH_START_M  (TOUCH_AON_TOUCH_START_V << TOUCH_AON_TOUCH_START_S)
#define TOUCH_AON_TOUCH_START_V  0x00007FFFU
#define TOUCH_AON_TOUCH_START_S  0
/** TOUCH_AON_TOUCH_XPD : R/W; bitpos: [29:15]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_XPD    0x00007FFFU
#define TOUCH_AON_TOUCH_XPD_M  (TOUCH_AON_TOUCH_XPD_V << TOUCH_AON_TOUCH_XPD_S)
#define TOUCH_AON_TOUCH_XPD_V  0x00007FFFU
#define TOUCH_AON_TOUCH_XPD_S  15

/** TOUCH_AON_PAD0_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD0_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x48)
/** TOUCH_AON_TOUCH_PAD0_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD0_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH0_M  (TOUCH_AON_TOUCH_PAD0_TH0_V << TOUCH_AON_TOUCH_PAD0_TH0_S)
#define TOUCH_AON_TOUCH_PAD0_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH0_S  16

/** TOUCH_AON_PAD0_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD0_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x4c)
/** TOUCH_AON_TOUCH_PAD0_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD0_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH1_M  (TOUCH_AON_TOUCH_PAD0_TH1_V << TOUCH_AON_TOUCH_PAD0_TH1_S)
#define TOUCH_AON_TOUCH_PAD0_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH1_S  16

/** TOUCH_AON_PAD0_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD0_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x50)
/** TOUCH_AON_TOUCH_PAD0_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD0_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH2_M  (TOUCH_AON_TOUCH_PAD0_TH2_V << TOUCH_AON_TOUCH_PAD0_TH2_S)
#define TOUCH_AON_TOUCH_PAD0_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD0_TH2_S  16

/** TOUCH_AON_PAD1_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD1_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x54)
/** TOUCH_AON_TOUCH_PAD1_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD1_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH0_M  (TOUCH_AON_TOUCH_PAD1_TH0_V << TOUCH_AON_TOUCH_PAD1_TH0_S)
#define TOUCH_AON_TOUCH_PAD1_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH0_S  16

/** TOUCH_AON_PAD1_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD1_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x58)
/** TOUCH_AON_TOUCH_PAD1_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD1_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH1_M  (TOUCH_AON_TOUCH_PAD1_TH1_V << TOUCH_AON_TOUCH_PAD1_TH1_S)
#define TOUCH_AON_TOUCH_PAD1_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH1_S  16

/** TOUCH_AON_PAD1_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD1_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x5c)
/** TOUCH_AON_TOUCH_PAD1_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD1_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH2_M  (TOUCH_AON_TOUCH_PAD1_TH2_V << TOUCH_AON_TOUCH_PAD1_TH2_S)
#define TOUCH_AON_TOUCH_PAD1_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD1_TH2_S  16

/** TOUCH_AON_PAD2_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD2_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x60)
/** TOUCH_AON_TOUCH_PAD2_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD2_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH0_M  (TOUCH_AON_TOUCH_PAD2_TH0_V << TOUCH_AON_TOUCH_PAD2_TH0_S)
#define TOUCH_AON_TOUCH_PAD2_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH0_S  16

/** TOUCH_AON_PAD2_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD2_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x64)
/** TOUCH_AON_TOUCH_PAD2_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD2_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH1_M  (TOUCH_AON_TOUCH_PAD2_TH1_V << TOUCH_AON_TOUCH_PAD2_TH1_S)
#define TOUCH_AON_TOUCH_PAD2_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH1_S  16

