espressif/esp-idf/components/soc/esp32s31/register/soc/touch_aon_reg.h
/** TOUCH_AON_PAD2_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD2_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x68)
/** TOUCH_AON_TOUCH_PAD2_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD2_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH2_M  (TOUCH_AON_TOUCH_PAD2_TH2_V << TOUCH_AON_TOUCH_PAD2_TH2_S)
#define TOUCH_AON_TOUCH_PAD2_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD2_TH2_S  16

/** TOUCH_AON_PAD3_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD3_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x6c)
/** TOUCH_AON_TOUCH_PAD3_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD3_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH0_M  (TOUCH_AON_TOUCH_PAD3_TH0_V << TOUCH_AON_TOUCH_PAD3_TH0_S)
#define TOUCH_AON_TOUCH_PAD3_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH0_S  16

/** TOUCH_AON_PAD3_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD3_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x70)
/** TOUCH_AON_TOUCH_PAD3_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD3_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH1_M  (TOUCH_AON_TOUCH_PAD3_TH1_V << TOUCH_AON_TOUCH_PAD3_TH1_S)
#define TOUCH_AON_TOUCH_PAD3_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH1_S  16

/** TOUCH_AON_PAD3_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD3_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x74)
/** TOUCH_AON_TOUCH_PAD3_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD3_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH2_M  (TOUCH_AON_TOUCH_PAD3_TH2_V << TOUCH_AON_TOUCH_PAD3_TH2_S)
#define TOUCH_AON_TOUCH_PAD3_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD3_TH2_S  16

/** TOUCH_AON_PAD4_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD4_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x78)
/** TOUCH_AON_TOUCH_PAD4_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD4_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH0_M  (TOUCH_AON_TOUCH_PAD4_TH0_V << TOUCH_AON_TOUCH_PAD4_TH0_S)
#define TOUCH_AON_TOUCH_PAD4_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH0_S  16

/** TOUCH_AON_PAD4_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD4_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x7c)
/** TOUCH_AON_TOUCH_PAD4_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD4_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH1_M  (TOUCH_AON_TOUCH_PAD4_TH1_V << TOUCH_AON_TOUCH_PAD4_TH1_S)
#define TOUCH_AON_TOUCH_PAD4_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH1_S  16

/** TOUCH_AON_PAD4_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD4_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x80)
/** TOUCH_AON_TOUCH_PAD4_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD4_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH2_M  (TOUCH_AON_TOUCH_PAD4_TH2_V << TOUCH_AON_TOUCH_PAD4_TH2_S)
#define TOUCH_AON_TOUCH_PAD4_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD4_TH2_S  16

/** TOUCH_AON_PAD5_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD5_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x84)
/** TOUCH_AON_TOUCH_PAD5_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD5_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH0_M  (TOUCH_AON_TOUCH_PAD5_TH0_V << TOUCH_AON_TOUCH_PAD5_TH0_S)
#define TOUCH_AON_TOUCH_PAD5_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH0_S  16

/** TOUCH_AON_PAD5_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD5_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x88)
/** TOUCH_AON_TOUCH_PAD5_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD5_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH1_M  (TOUCH_AON_TOUCH_PAD5_TH1_V << TOUCH_AON_TOUCH_PAD5_TH1_S)
#define TOUCH_AON_TOUCH_PAD5_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH1_S  16

/** TOUCH_AON_PAD5_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD5_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x8c)
/** TOUCH_AON_TOUCH_PAD5_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD5_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH2_M  (TOUCH_AON_TOUCH_PAD5_TH2_V << TOUCH_AON_TOUCH_PAD5_TH2_S)
#define TOUCH_AON_TOUCH_PAD5_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD5_TH2_S  16

/** TOUCH_AON_PAD6_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD6_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x90)
/** TOUCH_AON_TOUCH_PAD6_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD6_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH0_M  (TOUCH_AON_TOUCH_PAD6_TH0_V << TOUCH_AON_TOUCH_PAD6_TH0_S)
#define TOUCH_AON_TOUCH_PAD6_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH0_S  16

/** TOUCH_AON_PAD6_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD6_TH1_REG (DR_REG_TOUCH_AON_BASE + 0x94)
/** TOUCH_AON_TOUCH_PAD6_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD6_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH1_M  (TOUCH_AON_TOUCH_PAD6_TH1_V << TOUCH_AON_TOUCH_PAD6_TH1_S)
#define TOUCH_AON_TOUCH_PAD6_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH1_S  16

/** TOUCH_AON_PAD6_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD6_TH2_REG (DR_REG_TOUCH_AON_BASE + 0x98)
/** TOUCH_AON_TOUCH_PAD6_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD6_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH2_M  (TOUCH_AON_TOUCH_PAD6_TH2_V << TOUCH_AON_TOUCH_PAD6_TH2_S)
#define TOUCH_AON_TOUCH_PAD6_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD6_TH2_S  16

/** TOUCH_AON_PAD7_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD7_TH0_REG (DR_REG_TOUCH_AON_BASE + 0x9c)
/** TOUCH_AON_TOUCH_PAD7_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD7_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH0_M  (TOUCH_AON_TOUCH_PAD7_TH0_V << TOUCH_AON_TOUCH_PAD7_TH0_S)
#define TOUCH_AON_TOUCH_PAD7_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH0_S  16

/** TOUCH_AON_PAD7_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD7_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xa0)
/** TOUCH_AON_TOUCH_PAD7_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD7_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH1_M  (TOUCH_AON_TOUCH_PAD7_TH1_V << TOUCH_AON_TOUCH_PAD7_TH1_S)
#define TOUCH_AON_TOUCH_PAD7_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH1_S  16

/** TOUCH_AON_PAD7_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD7_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xa4)
/** TOUCH_AON_TOUCH_PAD7_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD7_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH2_M  (TOUCH_AON_TOUCH_PAD7_TH2_V << TOUCH_AON_TOUCH_PAD7_TH2_S)
#define TOUCH_AON_TOUCH_PAD7_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD7_TH2_S  16

/** TOUCH_AON_PAD8_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD8_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xa8)
/** TOUCH_AON_TOUCH_PAD8_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD8_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH0_M  (TOUCH_AON_TOUCH_PAD8_TH0_V << TOUCH_AON_TOUCH_PAD8_TH0_S)
#define TOUCH_AON_TOUCH_PAD8_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH0_S  16

