espressif/esp-idf/components/soc/esp32s31/register/soc/touch_aon_reg.h
/** TOUCH_AON_PAD13_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD13_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xe8)
/** TOUCH_AON_TOUCH_PAD13_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD13_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH1_M  (TOUCH_AON_TOUCH_PAD13_TH1_V << TOUCH_AON_TOUCH_PAD13_TH1_S)
#define TOUCH_AON_TOUCH_PAD13_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH1_S  16

/** TOUCH_AON_PAD13_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD13_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xec)
/** TOUCH_AON_TOUCH_PAD13_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD13_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH2_M  (TOUCH_AON_TOUCH_PAD13_TH2_V << TOUCH_AON_TOUCH_PAD13_TH2_S)
#define TOUCH_AON_TOUCH_PAD13_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH2_S  16

/** TOUCH_AON_PAD14_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD14_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xf0)
/** TOUCH_AON_TOUCH_PAD14_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD14_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH0_M  (TOUCH_AON_TOUCH_PAD14_TH0_V << TOUCH_AON_TOUCH_PAD14_TH0_S)
#define TOUCH_AON_TOUCH_PAD14_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH0_S  16

/** TOUCH_AON_PAD14_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD14_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xf4)
/** TOUCH_AON_TOUCH_PAD14_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD14_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH1_M  (TOUCH_AON_TOUCH_PAD14_TH1_V << TOUCH_AON_TOUCH_PAD14_TH1_S)
#define TOUCH_AON_TOUCH_PAD14_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH1_S  16

/** TOUCH_AON_PAD14_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD14_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xf8)
/** TOUCH_AON_TOUCH_PAD14_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD14_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH2_M  (TOUCH_AON_TOUCH_PAD14_TH2_V << TOUCH_AON_TOUCH_PAD14_TH2_S)
#define TOUCH_AON_TOUCH_PAD14_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD14_TH2_S  16

/** TOUCH_AON_DATE_REG register
 *  need_des
 */
#define TOUCH_AON_DATE_REG (DR_REG_TOUCH_AON_BASE + 0xfc)
/** TOUCH_AON_DATE : R/W; bitpos: [30:0]; default: 38830400;
 *  need_des
 */
#define TOUCH_AON_DATE    0x7FFFFFFFU
#define TOUCH_AON_DATE_M  (TOUCH_AON_DATE_V << TOUCH_AON_DATE_S)
#define TOUCH_AON_DATE_V  0x7FFFFFFFU
#define TOUCH_AON_DATE_S  0
/** TOUCH_AON_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define TOUCH_AON_CLK_EN    (BIT(31))
#define TOUCH_AON_CLK_EN_M  (TOUCH_AON_CLK_EN_V << TOUCH_AON_CLK_EN_S)
#define TOUCH_AON_CLK_EN_V  0x00000001U
#define TOUCH_AON_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
